In [ ]:
#Задание 1
#Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера.
#Определите какому фильму было выставлено больше всего оценок 5.0.

In [3]:
import pandas as pd

In [41]:
movies=pd.read_csv('movies.csv')
movies[['movieId','title']].head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [42]:
ratings=pd.read_csv('ratings.csv')
ratings=ratings[['movieId','rating']]

In [43]:
joined = ratings.merge(movies, on='movieId', how='left')
joined[['movieId','rating','title']].head()

   movieId  rating                        title
0        1     4.0             Toy Story (1995)
1        3     4.0      Grumpier Old Men (1995)
2        6     4.0                  Heat (1995)
3       47     5.0  Seven (a.k.a. Se7en) (1995)
4       50     5.0   Usual Suspects, The (1995)

In [44]:
max_=ratings['rating'].max()
filtered_joined=joined[(joined ['rating']==max_)]
fr=filtered_joined.groupby(['movieId' , 'title'])['movieId'].count()

In [45]:
fr.sort_values(ascending=False).head()

movieId  title
318      Shawshank Redemption, The (1994)             153
296      Pulp Fiction (1994)                          123
356      Forrest Gump (1994)                          116
2571     Matrix, The (1999)                           109
260      Star Wars: Episode IV - A New Hope (1977)    104
Name: movieId, dtype: int64

In [ ]:
#Задание 2
#По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. 
#Не учитывайте в расчетах отрицательные значения quantity.

In [46]:
power=pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [47]:
filtered_countries = power[(power['country']=='Estonia') | (power['country']=='Lithuania') | (power['country']=='Latvia') ]
filtered_countries.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [52]:
fc=filtered_countries[(filtered_countries['category']==4) | (filtered_countries['category']==12) | 
(filtered_countries['category']==21) & (filtered_countries['year']<2010) & (filtered_countries['year']>2005)]
print('Суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года равно {}КВт'
      .format(fc['quantity'].sum()))

Суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года равно 165867.0КВт

In [ ]:
#Задание 3
#Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [40]:
pd.read_html('https://fortrader.org/')[0]

                                   Ближайшие события Время до выхода
0  Число работающих буровых установок, по данным ...        02:47:31
1  Индекс активности в производственном секторе о...        08:17:31
2  Индекс деловой активности в производственном с...        08:47:31
3                                 Данные по инфляции        10:47:31
4                       Индекс числа вакансий от ANZ        11:17:31

In [39]:
data=pd.read_html('https://fortrader.org/quotes')[1]
data.head()

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,66.80,-1.22,-1.79,NaN
1,Нефть WTI Цены на нефть WTI,63.62,-1.18,-1.82,NaN
2,Природный газ Цена на природный газ,2.93,0.03,0.96,NaN
3,Кофе,143.90,0.65,0.45,NaN
4,Кукуруза,659.60,-42.80,-6.09,NaN